## Pandas Tutorial
 for beginers form: https://analityk.edu.pl/python-pandas-mega-tutorial/

In [2]:
import os
import pandas as pd

In [3]:
lista = [[1,2,5,7],[11,22,55,77]]
df = pd.DataFrame(lista)
df.columns = ['One', 'Two', 'Three', 'Four']
print(df)

   One  Two  Three  Four
0    1    2      5     7
1   11   22     55    77

In [4]:
slownik = {'Imie':['Ania','Michał','Przemek'], 'Wiek':[18,25,40]}
print ( pd.DataFrame(slownik) )

      Imie  Wiek
0     Ania    18
1   Michał    25
2  Przemek    40

In [5]:
s = pd.Series([11,33,55,99])
print(s)

0    11
1    33
2    55
3    99
dtype: int64

In [6]:
# pandas_ods_reader
#
# Provides a function to read in an ODS file and returns a pandas DataFrame.
#
# It uses ezodf to read in the ods file. If a range is specified in the sheet to be imported, it seems that ezodf imports empty cells as well. Therefore, completely empty rows and columns are dropped from the DataFrame, before it is returned. Only trailing empty rows and columns are dropped.
#
# If the ODS file contains duplicated column names, they will be numbered and the number is appended to the column name in the resulting DataFrame.
# Dependencies
#
#     ezodf
#     lxml
#     pandas
#
# Installation
#
# pip install pandas_ods_reader
#

# In[5]:


'''
https://pypi.org/project/pandas-ods-reader/

from pandas_ods_reader import read_ods

path = "path/to/file.ods"

# load a sheet based on its index (1 based)
sheet_idx = 1
df = read_ods(path, sheet_idx)

# load a sheet based on its name
sheet_name = "sheet1"
df = read_ods(path, sheet_name)

# load a file that does not contain a header row
# if no columns are provided, they will be numbered
df = read_ods(path, 1, headers=False)

# load a file and provide custom column names
# if headers is True (the default), the header row will be overwritten
df = read_ods(path, 1, columns=["A", "B", "C"])
'''

'\nhttps://pypi.org/project/pandas-ods-reader/\n\nfrom pandas_ods_reader import read_ods\n\npath = "path/to/file.ods"\n\n# load a sheet based on its index (1 based)\nsheet_idx = 1\ndf = read_ods(path, sheet_idx)\n\n# load a sheet based on its name\nsheet_name = "sheet1"\ndf = read_ods(path, sheet_name)\n\n# load a file that does not contain a header row\n# if no columns are provided, they will be numbered\ndf = read_ods(path, 1, headers=False)\n\n# load a file and provide custom column names\n# if headers is True (the default), the header row will be overwritten\ndf = read_ods(path, 1, columns=["A", "B", "C"])\n'

In [7]:
data_path = ['Dane']
print (data_path)

from pandas_ods_reader import read_ods
filepath2 = os.sep.join(data_path + ['imiona.ods'])
df_ods = read_ods(filepath2, 1)
df_ods

['Dane']

       Imię               Nazwisko  Wiek       Płeć    Miasto
0    MIchał                  Rogal  42.0  Mężczyzna  Warszawa
1     Tomek                 Pierog   NaN  Mężczyzna    Kraków
2       Ewa                   None  25.0    kobieta      None
3      Ania               Śmietana  30.0    Kobieta  Warszawa
4     Kasia                Gwiazda  27.0    Kobieta   Ostróda
5   Mateusz                   Noga   NaN  Mężczyzna  Zakopane
6  Patrycja                 Maruda  18.0    Kobieta    Poznań
7      Adaś                 Dziura  53.0  Mężczyzna  Warszawa
8      Emil  Brzęszczyszczykiewicz  21.0  Mężczyzna    Kraków

In [8]:
filepath1 = os.sep.join(data_path + ['imiona.xls'])
print(filepath1)
df_xls = pd.read_excel(filepath1)
df_xls

Dane/imiona.xls

       Imię               Nazwisko  Wiek       Płeć    Miasto
0    MIchał                  Rogal  42.0  Mężczyzna  Warszawa
1     Tomek                 Pierog   NaN  Mężczyzna    Kraków
2       Ewa                    NaN  25.0    kobieta       NaN
3      Ania               Śmietana  30.0    Kobieta  Warszawa
4     Kasia                Gwiazda  27.0    Kobieta   Ostróda
5   Mateusz                   Noga   NaN  Mężczyzna  Zakopane
6  Patrycja                 Maruda  18.0    Kobieta    Poznań
7      Adaś                 Dziura  53.0  Mężczyzna  Warszawa
8      Emil  Brzęszczyszczykiewicz  21.0  Mężczyzna    Kraków

In [9]:
pd.read_excel(filepath1, sheet_name='Wynik', header=1)

       Imię               Nazwisko  Wynik
0    MIchał                  Rogal     77
1     Tomek                 Pierog     32
2       Ewa                    NaN     90
3      Ania               Śmietana     83
4     Kasia                Gwiazda     30
5   Mateusz                   Noga    102
6  Patrycja                 Maruda    202
7      Adaś                 Dziura     16
8      Emil  Brzęszczyszczykiewicz    100

In [10]:
pd.read_excel(filepath1, sheet_name='Wynik2',header=None, names=['Imię', 'Nazwisko', 'Wynik'])

       Imię               Nazwisko  Wynik
0    MIchał                  Rogal     77
1     Tomek                 Pierog     32
2       Ewa                    NaN     90
3      Ania               Śmietana     83
4     Kasia                Gwiazda     30
5   Mateusz                   Noga    102
6  Patrycja                 Maruda    202
7      Adaś                 Dziura     16
8      Emil  Brzęszczyszczykiewicz    100

In [11]:
kostium = pd.read_csv('https://analityk.edu.pl/wp-content/uploads/2020/12/Halloween.csv', header=2)
kostium.head()

       region             1            2             3         4          5
0      Alaska   Beetlejuice  Black Widow        Rabbit     Ninja    Pokemon
1     Alabama  Harley Quinn        Witch        Cowboy    Rabbit  Star Wars
2    Arkansas          Doll        Purge  Harley Quinn     1980s      Witch
3     Arizona        Rabbit        Witch         Ninja     Angel   Dinosaur
4  California         Witch        Clown        Rabbit  Fortnite   Dinosaur

In [12]:
# Pięć pierwszych wierszy
kostium[:5]

       region             1            2             3         4          5
0      Alaska   Beetlejuice  Black Widow        Rabbit     Ninja    Pokemon
1     Alabama  Harley Quinn        Witch        Cowboy    Rabbit  Star Wars
2    Arkansas          Doll        Purge  Harley Quinn     1980s      Witch
3     Arizona        Rabbit        Witch         Ninja     Angel   Dinosaur
4  California         Witch        Clown        Rabbit  Fortnite   Dinosaur

In [13]:
# 10 pierwszych wierszy i tylko i wyłącznie kolumny region oraz '1', czyli najpopularniejszy kostium
kostium[:10][['region','1']]

                 region                1
0                Alaska      Beetlejuice
1               Alabama     Harley Quinn
2              Arkansas             Doll
3               Arizona           Rabbit
4            California            Witch
5              Colorado         Dinosaur
6           Connecticut  Powerpuff Girls
7  District of Columbia          Beyonce
8              Delaware             Doll
9               Florida           Rabbit

In [14]:
kostium.loc[:10]

,region,1,2,3,4,5
0,Alaska,Beetlejuice,Black Widow,Rabbit,Ninja,Pokemon
1,Alabama,Harley Quinn,Witch,Cowboy,Rabbit,Star Wars
2,Arkansas,Doll,Purge,Harley Quinn,1980s,Witch
3,Arizona,Rabbit,Witch,Ninja,Angel,Dinosaur
4,California,Witch,Clown,Rabbit,Fortnite,Dinosaur
5,Colorado,Dinosaur,Witch,Bear,Harley Quinn,Clown
6,Connecticut,Powerpuff Girls,Angel,Mulan,Witch,Buzz Lightyear
7,District of Columbia,Beyonce,Powerpuff Girls,NaN,Luigi,Catwoman
8,Delaware,Doll,Princess,Dinosaur,Cowboy,Ghostbusters
9,Florida,Rabbit,Pirate,Angel,Dinosaur,Harley Quinn
10,Georgia,Witch,Ninja,Pirate,Dinosaur,Harley Quinn

In [15]:
kostium.set_index('region', inplace=True)
kostium.head()

                       1            2             3         4          5
region
Alaska       Beetlejuice  Black Widow        Rabbit     Ninja    Pokemon
Alabama     Harley Quinn        Witch        Cowboy    Rabbit  Star Wars
Arkansas            Doll        Purge  Harley Quinn     1980s      Witch
Arizona           Rabbit        Witch         Ninja     Angel   Dinosaur
California         Witch        Clown        Rabbit  Fortnite   Dinosaur

In [16]:
kostium.loc['Arizona']

1      Rabbit
2       Witch
3       Ninja
4       Angel
5    Dinosaur
Name: Arizona, dtype: object

In [17]:
kostium.iloc[3,2]

'Ninja'

In [18]:
kostium.reset_index(inplace=True)
for index, zawartosc in kostium.iterrows():
    if zawartosc['1'] == 'Rabbit':
        print(zawartosc['region'])

Arizona
Florida
Michigan
Virginia

In [19]:
kostium['1'] == 'Rabbit'

0     False
1     False
2     False
3      True
4     False
5     False
6     False
7     False
8     False
9      True
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22     True
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
34    False
35    False
36    False
37    False
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45     True
46    False
47    False
48    False
49    False
50    False
Name: 1, dtype: bool

In [20]:
kostium[  kostium['1'] == 'Rabbit'  ]

      region       1       2             3         4             5
3    Arizona  Rabbit   Witch         Ninja     Angel      Dinosaur
9    Florida  Rabbit  Pirate         Angel  Dinosaur  Harley Quinn
22  Michigan  Rabbit   Clown  Harley Quinn  Dinosaur         Witch
45  Virginia  Rabbit   Witch  Harley Quinn  Dinosaur    Spider-Man

In [21]:
kostium[  (kostium['1'] == 'Rabbit') | (kostium['1'] == 'Dinosaur')  ]

            region         1       2             3             4             5
3          Arizona    Rabbit   Witch         Ninja         Angel      Dinosaur
5         Colorado  Dinosaur   Witch          Bear  Harley Quinn         Clown
9          Florida    Rabbit  Pirate         Angel      Dinosaur  Harley Quinn
14        Illinois  Dinosaur   Witch         Angel         Devil          Bear
19   Massachusetts  Dinosaur  Rabbit      Fortnite        Zombie       Pumpkin
21           Maine  Dinosaur   Ninja         Alien         Alien         Witch
22        Michigan    Rabbit   Clown  Harley Quinn      Dinosaur         Witch
24        Missouri  Dinosaur   Witch    Spider-Man         Angel        Cowboy
27  North Carolina  Dinosaur   Witch  Harley Quinn        Rabbit         Ninja
34        New York  Dinosaur   Angel         Witch  Harley Quinn        Rabbit
45        Virginia    Rabbit   Witch  Harley Quinn      Dinosaur    Spider-Man

In [22]:
kostium[  (kostium['1'] == 'Witch') | (kostium['2'] == 'Ninja')  ]

,region,1,2,3,4,5
4,California,Witch,Clown,Rabbit,Fortnite,Dinosaur
10,Georgia,Witch,Ninja,Pirate,Dinosaur,Harley Quinn
13,Idaho,Witch,Bride Of Chucky,Ninja,Dragon,1990s
15,Indiana,Witch,Doll,Clown,Angel,Spider-Man
18,Louisiana,Witch,Cheerleader,Cowboy,Harley Quinn,Powerpuff Girls
21,Maine,Dinosaur,Ninja,Alien,Alien,Witch
23,Minnesota,Witch,Rabbit,Dinosaur,Angel,Devil
31,New Jersey,Witch,Angel,Pumpkin,Ninja,Spider-Man
33,Nevada,Witch,Spider-Man,Devil,It,Fairy
35,Ohio,Witch,Dinosaur,Harley Quinn,Angel,Bear
38,Pennsylvania,Witch,Dinosaur,Harley Quinn,Devil,Ninja
44,Utah,Witch,Rabbit,Dinosaur,Monsters Inc,Zombie
48,Wisconsin,Witch,Clown,Unicorn,Devil,Dinosaur

In [23]:
len(kostium[  (kostium['1'] ==  'Angel') | (kostium['1'] == 'Dinosaur')  ] )

9

In [24]:
kostium = kostium.rename(columns={'1':'Pierwszy', '2':'Drugi'})

In [25]:
kostium['Połączone'] = kostium['3'] + ' | ' + kostium['4']

In [26]:
kostium[['Trzeci','Czwarty']] = kostium.Połączone.str.split('|',expand=True)

In [27]:
kostium = kostium.drop(['3','4'], axis=1)
kostium.head()

,region,Pierwszy,Drugi,5,Połączone,Trzeci,Czwarty
0,Alaska,Beetlejuice,Black Widow,Pokemon,Rabbit | Ninja,Rabbit,Ninja
1,Alabama,Harley Quinn,Witch,Star Wars,Cowboy | Rabbit,Cowboy,Rabbit
2,Arkansas,Doll,Purge,Witch,Harley Quinn | 1980s,Harley Quinn,1980s
3,Arizona,Rabbit,Witch,Dinosaur,Ninja | Angel,Ninja,Angel
4,California,Witch,Clown,Dinosaur,Rabbit | Fortnite,Rabbit,Fortnite

In [28]:
kostium.dtypes

region       object
Pierwszy     object
Drugi        object
5            object
Połączone    object
Trzeci       object
Czwarty      object
dtype: object

In [29]:
df = pd.DataFrame({'Osoba':['Michał Jakub','Ewa Noga', 'Krzysztof Zawierucha'],
                  'Wynik':[15,38,21]})

In [30]:
def sprawdz(punkty):
        if punkty > 20: return 'Zdany'
        else: return 'Oblany'

In [31]:
df.Wynik = df.Wynik.apply(sprawdz)

In [32]:
df

                  Osoba   Wynik
0          Michał Jakub  Oblany
1              Ewa Noga   Zdany
2  Krzysztof Zawierucha   Zdany

In [33]:
films = pd.read_csv('https://analityk.edu.pl/wp-content/uploads/2020/12/film.csv', sep=';', encoding = "ISO-8859-1")

In [34]:
# Kasujemy pierwszy wiersz
films = films.drop(0)
# Kasujemy ostatnią kolumnę
films = films.drop(columns=['*Image'])
films.head()

,Year,Length,Title,Subject,Actor,Actress,Director,Popularity,Awards
1,1990,111,Tie Me Up! Tie Me Down!,Comedy,"Banderas, Antonio","Abril, Victoria","Almodóvar, Pedro",68,No
2,1991,113,High Heels,Comedy,"Bosé, Miguel","Abril, Victoria","Almodóvar, Pedro",68,No
3,1983,104,"Dead Zone, The",Horror,"Walken, Christopher","Adams, Brooke","Cronenberg, David",79,No
4,1979,122,Cuba,Action,"Connery, Sean","Adams, Brooke","Lester, Richard",6,No
5,1978,94,Days of Heaven,Drama,"Gere, Richard","Adams, Brooke","Malick, Terrence",14,No

In [35]:
films.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1659 entries, 1 to 1659
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Year        1659 non-null   object
 1   Length      1592 non-null   object
 2   Title       1659 non-null   object
 3   Subject     1657 non-null   object
 4   Actor       1651 non-null   object
 5   Actress     1281 non-null   object
 6   Director    1406 non-null   object
 7   Popularity  1653 non-null   object
 8   Awards      1659 non-null   object
dtypes: object(9)
memory usage: 129.6+ KB

In [36]:
films.Length = pd.to_numeric(films.Length)
films.dtypes

Year           object
Length        float64
Title          object
Subject        object
Actor          object
Actress        object
Director       object
Popularity     object
Awards         object
dtype: object

In [37]:
films.Length.mean()

105.17964824120602

In [38]:
films.Popularity = films.Popularity.astype('float64')

In [39]:
def zamien(wartosc):
    if wartosc == 'No': return False
    if wartosc == 'Yes': return True

films.Awards = films.Awards.apply(zamien)
films.dtypes

Year           object
Length        float64
Title          object
Subject        object
Actor          object
Actress        object
Director       object
Popularity    float64
Awards           bool
dtype: object

In [40]:
films2 = pd.read_csv('https://analityk.edu.pl/wp-content/uploads/2020/12/film.csv',
                    sep=';',
                    encoding = "ISO-8859-1",
                    skiprows=[1],
                    dtype={'Length':'float64', 'Popularity':'float64'},
                    usecols=['Year','Length','Title','Subject','Popularity','Awards'],
                    converters={'Awards':lambda x: True if x == 'Yes' else False})

In [41]:
films2.head()

   Year  Length                    Title Subject  Popularity  Awards
0  1990   111.0  Tie Me Up! Tie Me Down!  Comedy        68.0   False
1  1991   113.0               High Heels  Comedy        68.0   False
2  1983   104.0           Dead Zone, The  Horror        79.0   False
3  1979   122.0                     Cuba  Action         6.0   False
4  1978    94.0           Days of Heaven   Drama        14.0   False

In [42]:
films2.groupby('Year').count()

      Length  Title  Subject  Popularity  Awards
Year
1920       1      1        1           1       1
1923       1      1        1           0       1
1924       3      3        3           3       3
1925       1      1        1           1       1
1926       4      4        4           4       4
...      ...    ...      ...         ...     ...
1991     119    129      129         129     129
1992      84     88       88          88      88
1993      15     21       21          21      21
1996       1      1        1           1       1
1997       1      1        1           1       1

[74 rows x 5 columns]

In [43]:
films.groupby('Year').agg({'Popularity':['min','max'], 'Length':['min','max']})

     Popularity       Length
            min   max    min    max
Year
1920       29.0  29.0  137.0  137.0
1923        NaN   NaN   57.0   57.0
1924       63.0  79.0   95.0  123.0
1925       73.0  73.0  125.0  125.0
1926       49.0  76.0   66.0  139.0
...         ...   ...    ...    ...
1991        1.0  88.0   16.0  240.0
1992        0.0  88.0   52.0  286.0
1993        0.0  80.0   30.0  108.0
1996       39.0  39.0   96.0   96.0
1997       60.0  60.0  109.0  109.0

[74 rows x 4 columns]

In [44]:
films['Year'] = pd.to_numeric(films.Year)
films[(films['Year'] >- 1980) & (films['Year'] <= 1990)].groupby('Year').Length.mean()

Year
1920    137.000000
1923     57.000000
1924    109.333333
1925    125.000000
1926    110.000000
           ...
1986    101.829787
1987    101.420000
1988    104.326087
1989     99.623656
1990    100.728261
Name: Length, Length: 69, dtype: float64

In [45]:
x = films.groupby(['Year','Subject']).agg(avg_popularity = ('Popularity','mean'))
x.unstack()

        avg_popularity                                                       \
Subject         Action Adventure     Comedy Crime      Drama Fantasy Horror
Year
1920               NaN       NaN        NaN   NaN  29.000000     NaN    NaN
1923               NaN       NaN        NaN   NaN        NaN     NaN    NaN
1924               NaN       NaN        NaN   NaN  72.000000     NaN    NaN
1925               NaN       NaN        NaN   NaN  73.000000     NaN    NaN
1926         55.000000       NaN        NaN   NaN  72.000000     NaN    NaN
...                ...       ...        ...   ...        ...     ...    ...
1991         38.937500       NaN  42.540541   NaN  41.900000     NaN   41.6
1992         36.944444      39.0  51.333333   NaN  48.566667     NaN    NaN
1993         32.000000       NaN  38.428571   NaN  33.750000     NaN    NaN
1996               NaN       NaN        NaN   NaN        NaN     NaN   39.0
1997               NaN       NaN        NaN   NaN        NaN     NaN    NaN

                                                                            \
Subject      Music Mystery Romance Science Fiction Short    War    Western
Year
1920           NaN     NaN     NaN             NaN   NaN    NaN        NaN
1923           NaN     NaN     NaN             NaN   NaN    NaN        NaN
1924           NaN     NaN     NaN             NaN   NaN    NaN        NaN
1925           NaN     NaN     NaN             NaN   NaN    NaN        NaN
1926           NaN    76.0     NaN            49.0   NaN    NaN        NaN
...            ...     ...     ...             ...   ...    ...        ...
1991     53.714286    37.0     NaN            11.0   NaN  50.75  44.888889
1992     24.400000    39.2     NaN            36.5   NaN   3.00  28.500000
1993     48.000000    38.0     NaN             NaN   NaN    NaN  61.250000
1996           NaN     NaN     NaN             NaN   NaN    NaN        NaN
1997           NaN     NaN     NaN            60.0   NaN    NaN        NaN


Subject Westerns
Year
1920         NaN
1923         NaN
1924         NaN
1925         NaN
1926         NaN
...          ...
1991        22.5
1992        68.0
1993         NaN
1996         NaN
1997         NaN

[74 rows x 15 columns]

In [46]:
pd.pivot_table(films,
               index='Year',
               columns='Subject',
               values='Popularity',
               aggfunc='mean')

Subject,Action,Adventure,Comedy,Crime,Drama,Fantasy,Horror,Music,Mystery,Romance,Science Fiction,Short,War,Western,Westerns
Year,,,,,,,,,,,,,,,
1920,NaN,NaN,NaN,NaN,29.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1924,NaN,NaN,NaN,NaN,72.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1925,NaN,NaN,NaN,NaN,73.000000,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1926,55.000000,NaN,NaN,NaN,72.000000,NaN,NaN,NaN,76.0,NaN,49.0,NaN,NaN,NaN,NaN
1927,NaN,NaN,NaN,NaN,31.000000,NaN,NaN,NaN,45.0,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1991,38.937500,NaN,42.540541,NaN,41.900000,NaN,41.6,53.714286,37.0,NaN,11.0,NaN,50.75,44.888889,22.5
1992,36.944444,39.0,51.333333,NaN,48.566667,NaN,NaN,24.400000,39.2,NaN,36.5,NaN,3.00,28.500000,68.0
1993,32.000000,NaN,38.428571,NaN,33.750000,NaN,NaN,48.000000,38.0,NaN,NaN,NaN,NaN,61.250000,NaN
1996,NaN,NaN,NaN,NaN,NaN,NaN,39.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1997,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,60.0,NaN,NaN,NaN,NaN

In [47]:
x = films.groupby(['Year','Subject']).agg(avg_popularity = ('Popularity','mean'))
x = x.avg_popularity.apply(lambda x: 'Bardzo popularny' if x > 60 else 'Niszowy')
x.unstack(fill_value='')

Subject,Action,Adventure,Comedy,Crime,Drama,Fantasy,Horror,Music,Mystery,Romance,Science Fiction,Short,War,Western,Westerns
Year,,,,,,,,,,,,,,,
1920,,,,,Niszowy,,,,,,,,,,
1923,,,,,,,,,,,,,,Niszowy,
1924,,,,,Bardzo popularny,,,,,,,,,,
1925,,,,,Bardzo popularny,,,,,,,,,,
1926,Niszowy,,,,Bardzo popularny,,,,Bardzo popularny,,Niszowy,,,,
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1991,Niszowy,,Niszowy,,Niszowy,,Niszowy,Niszowy,Niszowy,,Niszowy,,Niszowy,Niszowy,Niszowy
1992,Niszowy,Niszowy,Niszowy,,Niszowy,,,Niszowy,Niszowy,,Niszowy,,Niszowy,Niszowy,Bardzo popularny
1993,Niszowy,,Niszowy,,Niszowy,,,Niszowy,Niszowy,,,,,Bardzo popularny,
1996,,,,,,,Niszowy,,,,,,,,
1997,,,,,,,,,,,Niszowy,,,,

In [48]:
age = pd.DataFrame({'Name':['Michał', 'Adam', 'Ewa', 'Jakub'],
                           'Age':[39,28,19,32]})

age2 = pd.DataFrame({'Name':['Mike'],
                           'Age':[50]})
city = pd.DataFrame({'Name':['Adam', 'Ewa', 'Ola', 'Krystian', 'Jacek'],
                            'City':['Warszawa', 'Kraków', 'Poznań', 'Zakopane', 'Olsztyn']})
age_new = pd.concat([age, age2], keys=['age', 'age2'])
age_new

          Name  Age
age  0  Michał   39
     1    Adam   28
     2     Ewa   19
     3   Jakub   32
age2 0    Mike   50

In [49]:
pd.merge(age_new, city, on='Name', how='inner')

   Name  Age      City
0  Adam   28  Warszawa
1   Ewa   19    Kraków

In [50]:
pd.merge(age_new, city, on='Name', how='left')

     Name  Age      City
0  Michał   39       NaN
1    Adam   28  Warszawa
2     Ewa   19    Kraków
3   Jakub   32       NaN
4    Mike   50       NaN

In [51]:
pd.merge(age_new, city, on='Name', how='right')

       Name   Age      City
0      Adam  28.0  Warszawa
1       Ewa  19.0    Kraków
2       Ola   NaN    Poznań
3  Krystian   NaN  Zakopane
4     Jacek   NaN   Olsztyn

In [52]:
pd.merge(age_new, city, on='Name', how='outer')

       Name   Age      City
0    Michał  39.0       NaN
1      Adam  28.0  Warszawa
2       Ewa  19.0    Kraków
3     Jakub  32.0       NaN
4      Mike  50.0       NaN
5       Ola   NaN    Poznań
6  Krystian   NaN  Zakopane
7     Jacek   NaN   Olsztyn